Gammel Opgave/TravelGoodApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:plan="http://planning.ws">
  <soapenv:Body>
    <plan:createItinerary>
      <customerID>3</customerID>
      <itineraryID>3</itineraryID>
    </plan:createItinerary>
  </soapenv:Body>
</soapenv:Envelope>